zephyrproject-rtos/hal_microchip/sam/sam_d5x_e5x/atsame54/include/component/tcc.h
#define TCC_WEXCTRL_OTMX_Pos                  _UINT32_(0)                                          /* (TCC_WEXCTRL) Output Matrix Position */
#define TCC_WEXCTRL_OTMX_Msk                  (_UINT32_(0x3) << TCC_WEXCTRL_OTMX_Pos)              /* (TCC_WEXCTRL) Output Matrix Mask */
#define TCC_WEXCTRL_OTMX(value)               (TCC_WEXCTRL_OTMX_Msk & (_UINT32_(value) << TCC_WEXCTRL_OTMX_Pos)) /* Assignment of value for OTMX in the TCC_WEXCTRL register */
#define TCC_WEXCTRL_DTIEN0_Pos                _UINT32_(8)                                          /* (TCC_WEXCTRL) Dead-time Insertion Generator 0 Enable Position */
#define TCC_WEXCTRL_DTIEN0_Msk                (_UINT32_(0x1) << TCC_WEXCTRL_DTIEN0_Pos)            /* (TCC_WEXCTRL) Dead-time Insertion Generator 0 Enable Mask */
#define TCC_WEXCTRL_DTIEN0(value)             (TCC_WEXCTRL_DTIEN0_Msk & (_UINT32_(value) << TCC_WEXCTRL_DTIEN0_Pos)) /* Assignment of value for DTIEN0 in the TCC_WEXCTRL register */
#define TCC_WEXCTRL_DTIEN1_Pos                _UINT32_(9)                                          /* (TCC_WEXCTRL) Dead-time Insertion Generator 1 Enable Position */
#define TCC_WEXCTRL_DTIEN1_Msk                (_UINT32_(0x1) << TCC_WEXCTRL_DTIEN1_Pos)            /* (TCC_WEXCTRL) Dead-time Insertion Generator 1 Enable Mask */
#define TCC_WEXCTRL_DTIEN1(value)             (TCC_WEXCTRL_DTIEN1_Msk & (_UINT32_(value) << TCC_WEXCTRL_DTIEN1_Pos)) /* Assignment of value for DTIEN1 in the TCC_WEXCTRL register */
#define TCC_WEXCTRL_DTIEN2_Pos                _UINT32_(10)                                         /* (TCC_WEXCTRL) Dead-time Insertion Generator 2 Enable Position */
#define TCC_WEXCTRL_DTIEN2_Msk                (_UINT32_(0x1) << TCC_WEXCTRL_DTIEN2_Pos)            /* (TCC_WEXCTRL) Dead-time Insertion Generator 2 Enable Mask */
#define TCC_WEXCTRL_DTIEN2(value)             (TCC_WEXCTRL_DTIEN2_Msk & (_UINT32_(value) << TCC_WEXCTRL_DTIEN2_Pos)) /* Assignment of value for DTIEN2 in the TCC_WEXCTRL register */
#define TCC_WEXCTRL_DTIEN3_Pos                _UINT32_(11)                                         /* (TCC_WEXCTRL) Dead-time Insertion Generator 3 Enable Position */
#define TCC_WEXCTRL_DTIEN3_Msk                (_UINT32_(0x1) << TCC_WEXCTRL_DTIEN3_Pos)            /* (TCC_WEXCTRL) Dead-time Insertion Generator 3 Enable Mask */
#define TCC_WEXCTRL_DTIEN3(value)             (TCC_WEXCTRL_DTIEN3_Msk & (_UINT32_(value) << TCC_WEXCTRL_DTIEN3_Pos)) /* Assignment of value for DTIEN3 in the TCC_WEXCTRL register */
#define TCC_WEXCTRL_DTLS_Pos                  _UINT32_(16)                                         /* (TCC_WEXCTRL) Dead-time Low Side Outputs Value Position */
#define TCC_WEXCTRL_DTLS_Msk                  (_UINT32_(0xFF) << TCC_WEXCTRL_DTLS_Pos)             /* (TCC_WEXCTRL) Dead-time Low Side Outputs Value Mask */
#define TCC_WEXCTRL_DTLS(value)               (TCC_WEXCTRL_DTLS_Msk & (_UINT32_(value) << TCC_WEXCTRL_DTLS_Pos)) /* Assignment of value for DTLS in the TCC_WEXCTRL register */
#define TCC_WEXCTRL_DTHS_Pos                  _UINT32_(24)                                         /* (TCC_WEXCTRL) Dead-time High Side Outputs Value Position */
#define TCC_WEXCTRL_DTHS_Msk                  (_UINT32_(0xFF) << TCC_WEXCTRL_DTHS_Pos)             /* (TCC_WEXCTRL) Dead-time High Side Outputs Value Mask */
#define TCC_WEXCTRL_DTHS(value)               (TCC_WEXCTRL_DTHS_Msk & (_UINT32_(value) << TCC_WEXCTRL_DTHS_Pos)) /* Assignment of value for DTHS in the TCC_WEXCTRL register */
#define TCC_WEXCTRL_Msk                       _UINT32_(0xFFFF0F03)                                 /* (TCC_WEXCTRL) Register Mask  */

#define TCC_WEXCTRL_DTIEN_Pos                 _UINT32_(8)                                          /* (TCC_WEXCTRL Position) Dead-time Insertion Generator x Enable */
#define TCC_WEXCTRL_DTIEN_Msk                 (_UINT32_(0xF) << TCC_WEXCTRL_DTIEN_Pos)             /* (TCC_WEXCTRL Mask) DTIEN */
#define TCC_WEXCTRL_DTIEN(value)              (TCC_WEXCTRL_DTIEN_Msk & (_UINT32_(value) << TCC_WEXCTRL_DTIEN_Pos)) 

/* -------- TCC_DRVCTRL : (TCC Offset: 0x18) (R/W 32) Driver Control -------- */
#define TCC_DRVCTRL_RESETVALUE                _UINT32_(0x00)                                       /*  (TCC_DRVCTRL) Driver Control  Reset Value */

#define TCC_DRVCTRL_NRE0_Pos                  _UINT32_(0)                                          /* (TCC_DRVCTRL) Non-Recoverable State 0 Output Enable Position */
#define TCC_DRVCTRL_NRE0_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRE0_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 0 Output Enable Mask */
#define TCC_DRVCTRL_NRE0(value)               (TCC_DRVCTRL_NRE0_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRE0_Pos)) /* Assignment of value for NRE0 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRE1_Pos                  _UINT32_(1)                                          /* (TCC_DRVCTRL) Non-Recoverable State 1 Output Enable Position */
#define TCC_DRVCTRL_NRE1_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRE1_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 1 Output Enable Mask */
#define TCC_DRVCTRL_NRE1(value)               (TCC_DRVCTRL_NRE1_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRE1_Pos)) /* Assignment of value for NRE1 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRE2_Pos                  _UINT32_(2)                                          /* (TCC_DRVCTRL) Non-Recoverable State 2 Output Enable Position */
#define TCC_DRVCTRL_NRE2_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRE2_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 2 Output Enable Mask */
#define TCC_DRVCTRL_NRE2(value)               (TCC_DRVCTRL_NRE2_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRE2_Pos)) /* Assignment of value for NRE2 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRE3_Pos                  _UINT32_(3)                                          /* (TCC_DRVCTRL) Non-Recoverable State 3 Output Enable Position */
#define TCC_DRVCTRL_NRE3_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRE3_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 3 Output Enable Mask */
#define TCC_DRVCTRL_NRE3(value)               (TCC_DRVCTRL_NRE3_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRE3_Pos)) /* Assignment of value for NRE3 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRE4_Pos                  _UINT32_(4)                                          /* (TCC_DRVCTRL) Non-Recoverable State 4 Output Enable Position */
#define TCC_DRVCTRL_NRE4_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRE4_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 4 Output Enable Mask */
#define TCC_DRVCTRL_NRE4(value)               (TCC_DRVCTRL_NRE4_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRE4_Pos)) /* Assignment of value for NRE4 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRE5_Pos                  _UINT32_(5)                                          /* (TCC_DRVCTRL) Non-Recoverable State 5 Output Enable Position */
#define TCC_DRVCTRL_NRE5_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRE5_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 5 Output Enable Mask */
#define TCC_DRVCTRL_NRE5(value)               (TCC_DRVCTRL_NRE5_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRE5_Pos)) /* Assignment of value for NRE5 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRE6_Pos                  _UINT32_(6)                                          /* (TCC_DRVCTRL) Non-Recoverable State 6 Output Enable Position */
#define TCC_DRVCTRL_NRE6_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRE6_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 6 Output Enable Mask */
#define TCC_DRVCTRL_NRE6(value)               (TCC_DRVCTRL_NRE6_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRE6_Pos)) /* Assignment of value for NRE6 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRE7_Pos                  _UINT32_(7)                                          /* (TCC_DRVCTRL) Non-Recoverable State 7 Output Enable Position */
#define TCC_DRVCTRL_NRE7_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRE7_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 7 Output Enable Mask */
#define TCC_DRVCTRL_NRE7(value)               (TCC_DRVCTRL_NRE7_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRE7_Pos)) /* Assignment of value for NRE7 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRV0_Pos                  _UINT32_(8)                                          /* (TCC_DRVCTRL) Non-Recoverable State 0 Output Value Position */
#define TCC_DRVCTRL_NRV0_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRV0_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 0 Output Value Mask */
#define TCC_DRVCTRL_NRV0(value)               (TCC_DRVCTRL_NRV0_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRV0_Pos)) /* Assignment of value for NRV0 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRV1_Pos                  _UINT32_(9)                                          /* (TCC_DRVCTRL) Non-Recoverable State 1 Output Value Position */
#define TCC_DRVCTRL_NRV1_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRV1_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 1 Output Value Mask */
#define TCC_DRVCTRL_NRV1(value)               (TCC_DRVCTRL_NRV1_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRV1_Pos)) /* Assignment of value for NRV1 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRV2_Pos                  _UINT32_(10)                                         /* (TCC_DRVCTRL) Non-Recoverable State 2 Output Value Position */
#define TCC_DRVCTRL_NRV2_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRV2_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 2 Output Value Mask */
#define TCC_DRVCTRL_NRV2(value)               (TCC_DRVCTRL_NRV2_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRV2_Pos)) /* Assignment of value for NRV2 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRV3_Pos                  _UINT32_(11)                                         /* (TCC_DRVCTRL) Non-Recoverable State 3 Output Value Position */
#define TCC_DRVCTRL_NRV3_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRV3_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 3 Output Value Mask */
#define TCC_DRVCTRL_NRV3(value)               (TCC_DRVCTRL_NRV3_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRV3_Pos)) /* Assignment of value for NRV3 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRV4_Pos                  _UINT32_(12)                                         /* (TCC_DRVCTRL) Non-Recoverable State 4 Output Value Position */
#define TCC_DRVCTRL_NRV4_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRV4_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 4 Output Value Mask */
#define TCC_DRVCTRL_NRV4(value)               (TCC_DRVCTRL_NRV4_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRV4_Pos)) /* Assignment of value for NRV4 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRV5_Pos                  _UINT32_(13)                                         /* (TCC_DRVCTRL) Non-Recoverable State 5 Output Value Position */
#define TCC_DRVCTRL_NRV5_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRV5_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 5 Output Value Mask */
#define TCC_DRVCTRL_NRV5(value)               (TCC_DRVCTRL_NRV5_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRV5_Pos)) /* Assignment of value for NRV5 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRV6_Pos                  _UINT32_(14)                                         /* (TCC_DRVCTRL) Non-Recoverable State 6 Output Value Position */
#define TCC_DRVCTRL_NRV6_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRV6_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 6 Output Value Mask */
#define TCC_DRVCTRL_NRV6(value)               (TCC_DRVCTRL_NRV6_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRV6_Pos)) /* Assignment of value for NRV6 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_NRV7_Pos                  _UINT32_(15)                                         /* (TCC_DRVCTRL) Non-Recoverable State 7 Output Value Position */
#define TCC_DRVCTRL_NRV7_Msk                  (_UINT32_(0x1) << TCC_DRVCTRL_NRV7_Pos)              /* (TCC_DRVCTRL) Non-Recoverable State 7 Output Value Mask */
#define TCC_DRVCTRL_NRV7(value)               (TCC_DRVCTRL_NRV7_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRV7_Pos)) /* Assignment of value for NRV7 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_INVEN0_Pos                _UINT32_(16)                                         /* (TCC_DRVCTRL) Output Waveform 0 Inversion Position */
#define TCC_DRVCTRL_INVEN0_Msk                (_UINT32_(0x1) << TCC_DRVCTRL_INVEN0_Pos)            /* (TCC_DRVCTRL) Output Waveform 0 Inversion Mask */
#define TCC_DRVCTRL_INVEN0(value)             (TCC_DRVCTRL_INVEN0_Msk & (_UINT32_(value) << TCC_DRVCTRL_INVEN0_Pos)) /* Assignment of value for INVEN0 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_INVEN1_Pos                _UINT32_(17)                                         /* (TCC_DRVCTRL) Output Waveform 1 Inversion Position */
#define TCC_DRVCTRL_INVEN1_Msk                (_UINT32_(0x1) << TCC_DRVCTRL_INVEN1_Pos)            /* (TCC_DRVCTRL) Output Waveform 1 Inversion Mask */
#define TCC_DRVCTRL_INVEN1(value)             (TCC_DRVCTRL_INVEN1_Msk & (_UINT32_(value) << TCC_DRVCTRL_INVEN1_Pos)) /* Assignment of value for INVEN1 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_INVEN2_Pos                _UINT32_(18)                                         /* (TCC_DRVCTRL) Output Waveform 2 Inversion Position */
#define TCC_DRVCTRL_INVEN2_Msk                (_UINT32_(0x1) << TCC_DRVCTRL_INVEN2_Pos)            /* (TCC_DRVCTRL) Output Waveform 2 Inversion Mask */
#define TCC_DRVCTRL_INVEN2(value)             (TCC_DRVCTRL_INVEN2_Msk & (_UINT32_(value) << TCC_DRVCTRL_INVEN2_Pos)) /* Assignment of value for INVEN2 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_INVEN3_Pos                _UINT32_(19)                                         /* (TCC_DRVCTRL) Output Waveform 3 Inversion Position */
#define TCC_DRVCTRL_INVEN3_Msk                (_UINT32_(0x1) << TCC_DRVCTRL_INVEN3_Pos)            /* (TCC_DRVCTRL) Output Waveform 3 Inversion Mask */
#define TCC_DRVCTRL_INVEN3(value)             (TCC_DRVCTRL_INVEN3_Msk & (_UINT32_(value) << TCC_DRVCTRL_INVEN3_Pos)) /* Assignment of value for INVEN3 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_INVEN4_Pos                _UINT32_(20)                                         /* (TCC_DRVCTRL) Output Waveform 4 Inversion Position */
#define TCC_DRVCTRL_INVEN4_Msk                (_UINT32_(0x1) << TCC_DRVCTRL_INVEN4_Pos)            /* (TCC_DRVCTRL) Output Waveform 4 Inversion Mask */
#define TCC_DRVCTRL_INVEN4(value)             (TCC_DRVCTRL_INVEN4_Msk & (_UINT32_(value) << TCC_DRVCTRL_INVEN4_Pos)) /* Assignment of value for INVEN4 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_INVEN5_Pos                _UINT32_(21)                                         /* (TCC_DRVCTRL) Output Waveform 5 Inversion Position */
#define TCC_DRVCTRL_INVEN5_Msk                (_UINT32_(0x1) << TCC_DRVCTRL_INVEN5_Pos)            /* (TCC_DRVCTRL) Output Waveform 5 Inversion Mask */
#define TCC_DRVCTRL_INVEN5(value)             (TCC_DRVCTRL_INVEN5_Msk & (_UINT32_(value) << TCC_DRVCTRL_INVEN5_Pos)) /* Assignment of value for INVEN5 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_INVEN6_Pos                _UINT32_(22)                                         /* (TCC_DRVCTRL) Output Waveform 6 Inversion Position */
#define TCC_DRVCTRL_INVEN6_Msk                (_UINT32_(0x1) << TCC_DRVCTRL_INVEN6_Pos)            /* (TCC_DRVCTRL) Output Waveform 6 Inversion Mask */
#define TCC_DRVCTRL_INVEN6(value)             (TCC_DRVCTRL_INVEN6_Msk & (_UINT32_(value) << TCC_DRVCTRL_INVEN6_Pos)) /* Assignment of value for INVEN6 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_INVEN7_Pos                _UINT32_(23)                                         /* (TCC_DRVCTRL) Output Waveform 7 Inversion Position */
#define TCC_DRVCTRL_INVEN7_Msk                (_UINT32_(0x1) << TCC_DRVCTRL_INVEN7_Pos)            /* (TCC_DRVCTRL) Output Waveform 7 Inversion Mask */
#define TCC_DRVCTRL_INVEN7(value)             (TCC_DRVCTRL_INVEN7_Msk & (_UINT32_(value) << TCC_DRVCTRL_INVEN7_Pos)) /* Assignment of value for INVEN7 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_FILTERVAL0_Pos            _UINT32_(24)                                         /* (TCC_DRVCTRL) Non-Recoverable Fault Input 0 Filter Value Position */
#define TCC_DRVCTRL_FILTERVAL0_Msk            (_UINT32_(0xF) << TCC_DRVCTRL_FILTERVAL0_Pos)        /* (TCC_DRVCTRL) Non-Recoverable Fault Input 0 Filter Value Mask */
#define TCC_DRVCTRL_FILTERVAL0(value)         (TCC_DRVCTRL_FILTERVAL0_Msk & (_UINT32_(value) << TCC_DRVCTRL_FILTERVAL0_Pos)) /* Assignment of value for FILTERVAL0 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_FILTERVAL1_Pos            _UINT32_(28)                                         /* (TCC_DRVCTRL) Non-Recoverable Fault Input 1 Filter Value Position */
#define TCC_DRVCTRL_FILTERVAL1_Msk            (_UINT32_(0xF) << TCC_DRVCTRL_FILTERVAL1_Pos)        /* (TCC_DRVCTRL) Non-Recoverable Fault Input 1 Filter Value Mask */
#define TCC_DRVCTRL_FILTERVAL1(value)         (TCC_DRVCTRL_FILTERVAL1_Msk & (_UINT32_(value) << TCC_DRVCTRL_FILTERVAL1_Pos)) /* Assignment of value for FILTERVAL1 in the TCC_DRVCTRL register */
#define TCC_DRVCTRL_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (TCC_DRVCTRL) Register Mask  */

#define TCC_DRVCTRL_NRE_Pos                   _UINT32_(0)                                          /* (TCC_DRVCTRL Position) Non-Recoverable State x Output Enable */
#define TCC_DRVCTRL_NRE_Msk                   (_UINT32_(0xFF) << TCC_DRVCTRL_NRE_Pos)              /* (TCC_DRVCTRL Mask) NRE */
#define TCC_DRVCTRL_NRE(value)                (TCC_DRVCTRL_NRE_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRE_Pos)) 
#define TCC_DRVCTRL_NRV_Pos                   _UINT32_(8)                                          /* (TCC_DRVCTRL Position) Non-Recoverable State x Output Value */
#define TCC_DRVCTRL_NRV_Msk                   (_UINT32_(0xFF) << TCC_DRVCTRL_NRV_Pos)              /* (TCC_DRVCTRL Mask) NRV */
#define TCC_DRVCTRL_NRV(value)                (TCC_DRVCTRL_NRV_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRV_Pos)) 
#define TCC_DRVCTRL_INVEN_Pos                 _UINT32_(16)                                         /* (TCC_DRVCTRL Position) Output Waveform x Inversion */
#define TCC_DRVCTRL_INVEN_Msk                 (_UINT32_(0xFF) << TCC_DRVCTRL_INVEN_Pos)            /* (TCC_DRVCTRL Mask) INVEN */
#define TCC_DRVCTRL_INVEN(value)              (TCC_DRVCTRL_INVEN_Msk & (_UINT32_(value) << TCC_DRVCTRL_INVEN_Pos)) 

